bonjour|hello
au revoir|goodbye
merci|thanks
s'il vous plaît|please
excusez-moi|excuse me
pardon|sorry
oui|yes
non|no
peut-être|maybe
de rien|welcome
salut|hi
bonsoir|good evening
bonne nuit|good night
à bientôt|see you
ça va|how are you
très bien|very good
comment|how
où|where
quand|when
pourquoi|why
qui|who
quoi|what
le|the
la|the
les|the
un|a
une|a
et|and
ou|or
mais|but
avec|with
sans|without
pour|for
dans|in
sur|on
sous|under
devant|front
derrière|behind
à côté|beside
entre|between
chez|at
de|of
à|to
vers|toward
depuis|since
pendant|during
après|after
avant|before
maintenant|now
aujourd'hui|today
hier|yesterday
demain|tomorrow
semaine|week
mois|month
année|year
jour|day
nuit|night
matin|morning
midi|noon
soir|evening
temps|time
heure|hour
minute|minute
lundi|monday
mardi|tuesday
mercredi|wednesday
jeudi|thursday
vendredi|friday
samedi|saturday
dimanche|sunday
janvier|january
février|february
mars|march
avril|april
mai|may
juin|june
juillet|july
août|august
septembre|september
octobre|october
novembre|november
décembre|december
printemps|spring
été|summer
automne|autumn
hiver|winter
je|I
tu|you
il|he
elle|she
nous|we
vous|you
ils|they
elles|they
mon|my
ma|my
mes|my
ton|your
ta|your
tes|your
son|his
sa|her
ses|their
notre|our
votre|your
leur|their
être|be
avoir|have
faire|do
aller|go
venir|come
voir|see
savoir|know
pouvoir|can
vouloir|want
devoir|must
dire|say
prendre|take
donner|give
mettre|put
partir|leave
arriver|arrive
rester|stay
sortir|exit
entrer|enter
monter|up
descendre|down
tourner|turn
marcher|walk
courir|run
nager|swim
voler|fly
tomber|fall
porter|carry
tenir|hold
ouvrir|open
fermer|close
commencer|start
finir|finish
continuer|continue
arrêter|stop
choisir|choose
essayer|try
réussir|succeed
gagner|win
perdre|lose
trouver|find
chercher|search
montrer|show
expliquer|explain
comprendre|understand
apprendre|learn
enseigner|teach
étudier|study
lire|read
écrire|write
écouter|listen
parler|speak
répondre|answer
demander|ask
penser|think
croire|believe
espérer|hope
rêver|dream
dormir|sleep
manger|eat
boire|drink
cuisiner|cook
acheter|buy
vendre|sell
payer|pay
coûter|cost
aimer|love
détester|hate
préférer|prefer
chanter|sing
danser|dance
jouer|play
regarder|watch
sentir|smell
goûter|taste
toucher|touch
maison|house
appartement|apartment
chambre|room
salon|living room
cuisine|kitchen
salle de bain|bathroom
toilettes|toilet
bureau|office
garage|garage
jardin|garden
porte|door
fenêtre|window
mur|wall
plafond|ceiling
sol|floor
escalier|stairs
balcon|balcony
cave|basement
lit|bed
table|table
chaise|chair
canapé|sofa
fauteuil|armchair
armoire|wardrobe
étagère|shelf
lampe|lamp
télévision|TV
ordinateur|computer
téléphone|phone
réfrigérateur|fridge
four|oven
micro-ondes|microwave
machine à laver|washer
miroir|mirror
horloge|clock
clé|key
famille|family
parents|parents
père|father
mère|mother
fils|son
fille|daughter
frère|brother
sœur|sister
grand-père|grandfather
grand-mère|grandmother
oncle|uncle
tante|aunt
cousin|cousin
mari|husband
femme|wife
enfant|child
bébé|baby
ami|friend
voisin|neighbor
homme|man
garçon|boy
personne|person
gens|people
corps|body
tête|head
visage|face
œil|eye
yeux|eyes
nez|nose
bouche|mouth
oreille|ear
cheveux|hair
cou|neck
bras|arm
main|hand
doigt|finger
jambe|leg
pied|foot
dos|back
ventre|stomach
cœur|heart
rouge|red
bleu|blue
vert|green
jaune|yellow
orange|orange
violet|purple
rose|pink
noir|black
blanc|white
gris|gray
marron|brown
grand|big
petit|small
long|long
court|short
large|wide
étroit|narrow
haut|high
bas|low
gros|fat
mince|thin
fort|strong
faible|weak
rapide|fast
lent|slow
chaud|hot
froid|cold
tiède|warm
frais|cool
sec|dry
humide|wet
propre|clean
sale|dirty
nouveau|new
vieux|old
jeune|young
âgé|elderly
beau|beautiful
joli|pretty
laid|ugly
bon|good
mauvais|bad
facile|easy
difficile|hard
simple|simple
riche|rich
pauvre|poor
cher|expensive
bon marché|cheap
gratuit|free
plein|full
vide|empty
ouvert|open
fermé|closed
content|happy
triste|sad
fâché|angry
surpris|surprised
fatigué|tired
malade|sick
en forme|fit
animal|animal
chien|dog
chat|cat
oiseau|bird
poisson|fish
cheval|horse
vache|cow
cochon|pig
mouton|sheep
lapin|rabbit
souris|mouse
éléphant|elephant
lion|lion
tigre|tiger
ours|bear
loup|wolf
singe|monkey
nourriture|food
pain|bread
viande|meat
poulet|chicken
bœuf|beef
porc|pork
légume|vegetable
fruit|fruit
pomme|apple
banane|banana
orange|orange
citron|lemon
tomate|tomato
carotte|carrot
pomme de terre|potato
salade|salad
riz|rice
pâtes|pasta
fromage|cheese
lait|milk
œuf|egg
beurre|butter
sucre|sugar
sel|salt
poivre|pepper
eau|water
jus|juice
café|coffee
thé|tea
vin|wine
bière|beer
restaurant|restaurant
café|café
bar|bar
magasin|store
supermarché|supermarket
boulangerie|bakery
pharmacie|pharmacy
banque|bank
poste|post office
hôpital|hospital
école|school
université|university
bibliothèque|library
musée|museum
cinéma|cinema
théâtre|theater
parc|park
plage|beach
montagne|mountain
forêt|forest
lac|lake
rivière|river
mer|sea
océan|ocean
ville|city
village|village
rue|street
avenue|avenue
place|square
pont|bridge
gare|station
aéroport|airport
hôtel|hotel
voiture|car
bus|bus
train|train
métro|subway
taxi|taxi
vélo|bike
moto|motorcycle
avion|plane
bateau|boat
pied|foot
gauche|left
droite|right
tout droit|straight
nord|north
sud|south
est|east
ouest|west
près|near
loin|far
ici|here
là|there
beaucoup|much
peu|little
plus|more
moins|less
très|very
assez|enough
trop|too
toujours|always
souvent|often
parfois|sometimes
jamais|never
déjà|already
encore|still
bientôt|soon
tard|late
tôt|early
vite|fast
lentement|slowly
bien|well
mal|badly
mieux|better
pire|worse
travail|work
patron|boss
collègue|colleague
employé|employee
professeur|teacher
élève|student
médecin|doctor
infirmière|nurse
policier|police
pompier|firefighter
avocat|lawyer
ingénieur|engineer
architecte|architect
artiste|artist
musicien|musician
acteur|actor
écrivain|writer
journaliste|journalist
cuisinier|cook
serveur|waiter
vendeur|seller
chauffeur|driver
sport|sport
football|soccer
basketball|basketball
tennis|tennis
natation|swimming
course|running
vélo|cycling
ski|skiing
danse|dance
musique|music
concert|concert
film|movie
livre|book
magazine|magazine
journal|newspaper
radio|radio
internet|internet
photo|photo
vacances|vacation
voyage|trip
billet|ticket
passeport|passport
valise|suitcase
carte|map
guide|guide
touriste|tourist
piscine|pool
château|castle
église|church
monument|monument
statue|statue
argent|money
euro|euro
dollar|dollar
prix|price
facture|bill
carte de crédit|credit card
chèque|check
espèces|cash
cadeau|gift
anniversaire|birthday
fête|party
mariage|wedding
Noël|Christmas
nouvel an|new year
pâques|easter
problème|problem
solution|solution
question|question
réponse|answer
aide|help
conseil|advice
idée|idea
plan|plan
projet|project
but|goal
succès|success
échec|failure
chance|luck
risque|risk
danger|danger
sécurité|safety
paix|peace
guerre|war
politique|politics
gouvernement|government
président|president
élection|election
vote|vote
loi|law
justice|justice
police|police
crime|crime
accident|accident
urgence|emergency
ambulance|ambulance
médicament|medicine
docteur|doctor
blessé|injured
douleur|pain
fièvre|fever
rhume|cold
grippe|flu
mal de tête|headache
fatigue|fatigue
stress|stress
santé|health
exercice|exercise
régime|diet
vitamines|vitamins
nature|nature
environnement|environment
air|air
pollution|pollution
recyclage|recycling
énergie|energy
électricité|electricity
gaz|gas
pétrole|oil
soleil|sun
lune|moon
étoiles|stars
ciel|sky
nuage|cloud
pluie|rain
neige|snow
vent|wind
orage|storm
température|temperature
degré|degree
saison|season
climat|climate
météo|weather
éducation|education
leçon|lesson
cours|class
examen|exam
note|grade
diplôme|diploma
recherche|research
science|science
mathématiques|math
physique|physics
chimie|chemistry
biologie|biology
histoire|history
géographie|geography
littérature|literature
philosophie|philosophy
psychologie|psychology
économie|economics
art|art
peinture|painting
sculpture|sculpture
dessin|drawing
photographie|photography
architecture|architecture
design|design
mode|fashion
style|style
beauté|beauty
culture|culture
tradition|tradition
religion|religion
église|church
temple|temple
prière|prayer
dieu|god
âme|soul
paradis|heaven
ange|angel
miracle|miracle
foi|faith
espoir|hope
amour|love
haine|hate
jalousie|jealousy
colère|anger
peur|fear
courage|courage
patience|patience
gentillesse|kindness
générosité|generosity
mensonge|lie
vérité|truth
secret|secret
promesse|promise
confiance|trust
respect|respect
honneur|honor
fierté|pride
honte|shame
regret|regret
pardon|forgiveness
excuse|excuse
félicitations|congratulations
numéro|number
zéro|zero
un|one
deux|two
trois|three
quatre|four
cinq|five
six|six
sept|seven
huit|eight
neuf|nine
dix|ten
onze|eleven
douze|twelve
treize|thirteen
quatorze|fourteen
quinze|fifteen
seize|sixteen
dix-sept|seventeen
dix-huit|eighteen
dix-neuf|nineteen
vingt|twenty
trente|thirty
quarante|forty
cinquante|fifty
soixante|sixty
soixante-dix|seventy
quatre-vingts|eighty
quatre-vingt-dix|ninety
cent|hundred
mille|thousand
million|million
premier|first
deuxième|second
troisième|third
dernier|last
moitié|half
quart|quarter
double|double
triple|triple
fois|times
plus|plus
moins|minus
égal|equals
pourcentage|percent
calculer|calculate
compter|count
mesurer|measure
peser|weigh
taille|size
poids|weight
longueur|length
largeur|width
hauteur|height
profondeur|depth
distance|distance
kilomètre|kilometer
mètre|meter
centimètre|centimeter
gramme|gram
kilogramme|kilogram
litre|liter
forme|shape
cercle|circle
carré|square
triangle|triangle
rectangle|rectangle
ligne|line
point|point
angle|angle
côté|side
