être|be
avoir|have
je|I
de|of
ne|not
pas|not
le|the
la|the
tu|you
vous|you
il|he
et|and
à|to
un|a
qui|who
aller|go
les|the
en|in
ça|that
faire|do
tout|all
on|we
que|that
ce|this
une|a
mes|my
pour|for
se|himself
des|some
lui|him
tout|all
son|his
me|me
dire|say
mon|my
nous|we
si|if
te|you
mais|but
avec|with
elle|she
voir|see
dans|in
par|by
sur|on
bien|well
être|be
comme|like
très|very
après|after
quand|when
grand|big
petit|small
bon|good
mauvais|bad
beau|beautiful
nouveau|new
jeune|young
vieux|old
blanc|white
noir|black
rouge|red
bleu|blue
vert|green
jaune|yellow
orange|orange
rose|pink
violet|purple
gris|gray
marron|brown
eau|water
pain|bread
lait|milk
café|coffee
thé|tea
vin|wine
bière|beer
sucre|sugar
sel|salt
beurre|butter
fromage|cheese
viande|meat
poisson|fish
poulet|chicken
bœuf|beef
porc|pork
œuf|egg
pomme|apple
banane|banana
raisin|grape
poire|pear
citron|lemon
orange|orange
tomate|tomato
carotte|carrot
pomme de terre|potato
oignon|onion
ail|garlic
riz|rice
pâtes|pasta
salade|salad
soupe|soup
maison|house
appartement|apartment
chambre|room
cuisine|kitchen
salon|living room
salle de bain|bathroom
porte|door
fenêtre|window
lit|bed
table|table
chaise|chair
télévision|tv
ordinateur|computer
téléphone|phone
voiture|car
vélo|bike
bus|bus
train|train
avion|plane
bateau|boat
rue|street
route|road
ville|city
pays|country
monde|world
temps|time
heure|hour
jour|day
semaine|week
mois|month
année|year
matin|morning
midi|noon
soir|evening
nuit|night
aujourd'hui|today
hier|yesterday
demain|tomorrow
maintenant|now
toujours|always
jamais|never
souvent|often
parfois|sometimes
lundi|monday
mardi|tuesday
mercredi|wednesday
jeudi|thursday
vendredi|friday
samedi|saturday
dimanche|sunday
janvier|january
février|february
mars|march
avril|april
mai|may
juin|june
juillet|july
août|august
septembre|september
octobre|october
novembre|november
décembre|december
zéro|zero
un|one
deux|two
trois|three
quatre|four
cinq|five
six|six
sept|seven
huit|eight
neuf|nine
dix|ten
onze|eleven
douze|twelve
treize|thirteen
quatorze|fourteen
quinze|fifteen
seize|sixteen
dix-sept|seventeen
dix-huit|eighteen
dix-neuf|nineteen
vingt|twenty
trente|thirty
quarante|forty
cinquante|fifty
soixante|sixty
soixante-dix|seventy
quatre-vingts|eighty
quatre-vingt-dix|ninety
cent|hundred
mille|thousand
famille|family
père|father
mère|mother
fils|son
fille|daughter
frère|brother
sœur|sister
grand-père|grandfather
grand-mère|grandmother
oncle|uncle
tante|aunt
cousin|cousin
mari|husband
femme|wife
enfant|child
bébé|baby
homme|man
femme|woman
garçon|boy
fille|girl
ami|friend
personne|person
gens|people
chat|cat
chien|dog
oiseau|bird
poisson|fish
cheval|horse
vache|cow
mouton|sheep
cochon|pig
lapin|rabbit
souris|mouse
éléphant|elephant
lion|lion
tigre|tiger
ours|bear
singe|monkey
corps|body
tête|head
cheveux|hair
visage|face
œil|eye
nez|nose
bouche|mouth
dent|tooth
langue|tongue
oreille|ear
cou|neck
épaule|shoulder
bras|arm
main|hand
doigt|finger
poitrine|chest
dos|back
ventre|stomach
jambe|leg
pied|foot
manger|eat
boire|drink
dormir|sleep
marcher|walk
courir|run
nager|swim
voler|fly
sauter|jump
danser|dance
chanter|sing
écouter|listen
regarder|watch
lire|read
écrire|write
parler|speak
comprendre|understand
apprendre|learn
enseigner|teach
étudier|study
travailler|work
jouer|play
acheter|buy
vendre|sell
donner|give
prendre|take
porter|wear
ouvrir|open
fermer|close
commencer|start
finir|finish
venir|come
partir|leave
arriver|arrive
rester|stay
aimer|love
détester|hate
préférer|prefer
vouloir|want
pouvoir|can
devoir|must
savoir|know
penser|think
croire|believe
espérer|hope
sentir|feel
toucher|touch
école|school
université|university
classe|class
professeur|teacher
étudiant|student
livre|book
cahier|notebook
stylo|pen
crayon|pencil
papier|paper
bureau|desk
tableau|board
leçon|lesson
examen|exam
note|grade
devoirs|homework
mathématiques|math
histoire|history
géographie|geography
science|science
français|french
anglais|english
musique|music
art|art
sport|sport
hôpital|hospital
médecin|doctor
infirmière|nurse
médicament|medicine
maladie|illness
santé|health
mal|pain
fièvre|fever
rhume|cold
toux|cough
magasin|store
supermarché|supermarket
marché|market
restaurant|restaurant
café|cafe
hôtel|hotel
banque|bank
poste|post office
église|church
cinéma|cinema
théâtre|theater
musée|museum
parc|park
plage|beach
montagne|mountain
forêt|forest
jardin|garden
fleur|flower
arbre|tree
herbe|grass
pierre|stone
sable|sand
ciel|sky
nuage|cloud
soleil|sun
lune|moon
étoile|star
pluie|rain
neige|snow
vent|wind
chaud|hot
froid|cold
tiède|warm
frais|cool
sec|dry
mouillé|wet
grand|tall
petit|short
gros|fat
mince|thin
fort|strong
faible|weak
rapide|fast
lent|slow
facile|easy
difficile|hard
cher|expensive
pas cher|cheap
gratuit|free
plein|full
vide|empty
propre|clean
sale|dirty
neuf|new
vieux|old
cassé|broken
ouvert|open
fermé|closed
bonjour|hello
bonsoir|good evening
bonne nuit|good night
au revoir|goodbye
salut|hi
s'il vous plaît|please
merci|thank you
de rien|you're welcome
excusez-moi|excuse me
pardon|sorry
oui|yes
non|no
peut-être|maybe
d'accord|okay
comment|how
quoi|what
où|where
quand|when
pourquoi|why
qui|who
combien|how much
quel|which
argent|money
euro|euro
dollar|dollar
prix|price
coût|cost
acheter|buy
vendre|sell
payer|pay
économiser|save
dépenser|spend
riche|rich
pauvre|poor
travail|work
emploi|job
bureau|office
entreprise|company
patron|boss
collègue|colleague
salaire|salary
vacances|vacation
week-end|weekend
loisir|leisure
sport|sport
football|soccer
tennis|tennis
basketball|basketball
natation|swimming
course|running
cyclisme|cycling
lecture|reading
télévision|television
cinéma|cinema
musique|music
danse|dancing
voyage|travel
avion|airplane
train|train
voiture|car
bus|bus
taxi|taxi
métro|subway
vélo|bicycle
marche|walking
hôtel|hotel
camping|camping
valise|suitcase
passeport|passport
billet|ticket
réservation|reservation
matin|morning
midi|noon
après-midi|afternoon
soir|evening
nuit|night
tôt|early
tard|late
rapide|quick
lent|slow
maintenant|now
bientôt|soon
déjà|already
encore|still
jamais|never
toujours|always
parfois|sometimes
souvent|often
rarement|rarely
ici|here
là|there
partout|everywhere
nulle part|nowhere
dedans|inside
dehors|outside
devant|in front
derrière|behind
à côté|next to
près|near
loin|far
en haut|up
en bas|down
gauche|left
droite|right
centre|center
nord|north
sud|south
est|east
ouest|west
accepter|accept
accomplir|accomplish
acheter|buy
aider|help
aimer|love
aller|go
amener|bring
annoncer|announce
apercevoir|notice
apparaître|appear
appeler|call
apporter|bring
apprendre|learn
approcher|approach
arrêter|stop
arriver|arrive
asseoir|sit
attacher|attach
attaquer|attack
atteindre|reach
attendre|wait
attirer|attract
attraper|catch
augmenter|increase
avancer|advance
avoir|have
baisser|lower
battre|beat
boire|drink
bouger|move
brûler|burn
cacher|hide
casser|break
causer|cause
cesser|stop
changer|change
chanter|sing
charger|load
chercher|look for
choisir|choose
commencer|start
comprendre|understand
compter|count
conduire|drive
connaître|know
construire|build
contenir|contain
continuer|continue
coucher|lie down
couper|cut
courir|run
coûter|cost
couvrir|cover
craindre|fear
créer|create
crier|shout
croire|believe
croître|grow
cueillir|pick
cuire|cook
danser|dance
décider|decide
découvrir|discover
défendre|defend
demander|ask
demeurer|stay
descendre|go down
désirer|desire
devenir|become
devoir|must
dire|say
diriger|direct
disparaître|disappear
donner|give
dormir|sleep
douter|doubt
dresser|set up
durer|last
échapper|escape
éclairer|light up
écouter|listen
écrire|write
effectuer|carry out
empêcher|prevent
emporter|take away
entendre|hear
entrer|enter
envoyer|send
espérer|hope
essayer|try
établir|establish
être|be
étudier|study
éviter|avoid
excuser|excuse
exister|exist
expliquer|explain
exprimer|express
faire|do
falloir|be necessary
fermer|close
filer|spin
finir|finish
fixer|fix
foncer|rush
forcer|force
former|form
frapper|hit
gagner|win
garder|keep
glisser|slip
goûter|taste
grandir|grow
habiller|dress
habiter|live
imaginer|imagine
importer|matter
indiquer|indicate
inquiéter|worry
installer|install
interdire|forbid
intéresser|interest
inviter|invite
jeter|throw
joindre|join
jouer|play
juger|judge
jurer|swear
laisser|leave
lancer|throw
lever|lift
lire|read
livrer|deliver
loger|lodge
maintenir|maintain
manger|eat
manquer|miss
marcher|walk
marier|marry
marquer|mark
mener|lead
mentir|lie
mériter|deserve
mesurer|measure
mettre|put
monter|go up
montrer|show
morir|die
mouvoir|move
naître|be born
nécessiter|require
nettoyer|clean
nourrir|feed
obéir|obey
obliger|force
obtenir|obtain
occuper|occupy
offrir|offer
opposer|oppose
ordonner|order
organiser|organize
oser|dare
oublier|forget
ouvrir|open
paraître|appear
pardonner|forgive
parler|speak
partager|share
partir|leave
parvenir|succeed
passer|pass
payer|pay
pêcher|fish
pendre|hang
penser|think
perdre|lose
permettre|allow
peser|weigh
placer|place
plaindre|pity
plaire|please
planter|plant
pleurer|cry
pleuvoir|rain
plier|fold
porter|carry
poser|put
posséder|own
poursuivre|pursue
pousser|push
pouvoir|can
pratiquer|practice
préciser|specify
prédire|predict
préférer|prefer
prendre|take
préparer|prepare
présenter|present
préserver|preserve
prévoir|foresee
prier|pray
produire|produce
profiter|benefit
promettre|promise
proposer|propose
protéger|protect
prouver|prove
publier|publish
punir|punish
quitter|quit
raconter|tell
ralentir|slow down
ramasser|pick up
ramener|bring back
ranger|tidy
rappeler|recall
rapporter|bring back
recevoir|receive
reconnaître|recognize
recueillir|collect
reculer|back up
réduire|reduce
réfléchir|think
refuser|refuse
regarder|look
rejoindre|join
relever|pick up
remarquer|notice
remercier|thank
remettre|put back
remonter|go back up
remplacer|replace
rencontrer|meet
rendre|give back
renoncer|give up
rentrer|return
renverser|overturn
répandre|spread
réparer|repair
repartir|leave again
repasser|iron
répéter|repeat
répondre|answer
reposer|rest
reprendre|take back
représenter|represent
réserver|reserve
résoudre|solve
ressembler|resemble
ressortir|stand out
rester|stay
retenir|retain
retirer|remove
retourner|return
retrouver|find again
réunir|gather
réussir|succeed
réveiller|wake up
revenir|come back
rêver|dream
revoir|see again
rire|laugh
risquer|risk
rompre|break
rouler|roll
rouvrir|reopen
saisir|grab
saluer|greet
satisfaire|satisfy
sauter|jump
sauver|save
savoir|know
sécher|dry
secourir|help
sembler|seem
sentir|feel
serrer|squeeze
servir|serve
sortir|go out
souffler|blow
souffrir|suffer
souhaiter|wish
soulever|lift
sourire|smile
soutenir|support
souvenir|remember
suffire|be enough
suggérer|suggest
suivre|follow
supporter|support
supposer|suppose
surprendre|surprise
survivre|survive
taire|keep quiet
tenir|hold
tenter|try
terminer|finish
tirer|pull
tomber|fall
toucher|touch
tourner|turn
traduire|translate
traîner|drag
traiter|treat
transporter|transport
travailler|work
traverser|cross
tremper|soak
tromper|deceive
trouver|find
tuer|kill
unir|unite
utiliser|use
vaincre|defeat
valoir|be worth
vendre|sell
venir|come
verser|pour
vêtir|dress
vivre|live
voir|see
voisiner|neighbor
voler|steal
vouloir|want
voyager|travel